Repository: doubleden/RustQuiz
Catalog: RustQuiz/Localization/Localizable.xcstrings
Source language: en
Languages: ru

source: What does File::open("a.txt") return?
ru: Что означает файл::open("a.txt") return?

source: What does From do in the context of ?
ru: Что означает "С do in контекст"?

source: What does fs::read_to_string(path) return?
ru: Что означает fs::read_to_string(path) return?

source: What does glob use std::collections::*; do?
ru: Что означает glob use std ::collections::*; do?

source: What does impl Rectangle { fn new() -> Self { … } } do?
ru: Что означает impl Прямоугольник { fn new() -&gt; Self { ... } } do?

source: What does implementing Deref for Vec<T> allow?
ru: Что позволяет реализовать Deref for Vec<T> позволяет?

source: What does let a = [3; 4]; create?
ru: Что создает let a = [3; 4];?

source: What does match x { Some(i) => i, _ => 0 } do?
ru: Что означает match x { Some(i) =&gt; i, _ =&gt; 0 } do?

source: What does mem::replace() do differently from mem::take()?
ru: Чем mem::replace() do отличается от mem::take()?

source: What does mem::take() do?
ru: Что означает mem::take() do?

source: What does merge do with streams?
ru: Что означает слияние do с потоками?

source: What does monomorphization do?
ru: Что такое мономорфизация do?

source: What does mpsc::channel() return?
ru: Что означает mpsc::channel() return?

source: What does Mutex::lock() return on success?
ru: Что делает Mutex::lock() return в случае успеха?

source: What does Option::iter() return for Some(value)?
ru: Что означает Option::iter() return for Some (значение)?

source: What does or_insert(50) do?
ru: Что означает or_insert(50) do?

source: What does panic! do?
ru: Что значит паника! do?

source: What does poll return for a Future?
ru: Что такое опрос return for Будущее?

source: What does poll_next return?
ru: Что означает poll_next return?

source: What does procedural macro accept and return?
ru: Что принимают процедурные macro и return?

source: What does pub mod mean?
ru: Что означает pub mod ?

source: What does pub use crate::front_of_house::hosting; do?
ru: Что означает pub use crate ::front_of_house::хостинг; do?

source: What does pub use hosting; do?
ru: Что означает хостинг pub use ; do?

source: What does push do?
ru: Что такое push do?

source: What does push_str do?
ru: Что означает push_str do?

source: What does RAII stand for?
ru: Что означает RAII for?

source: What does Rc::clone do?
ru: Что означает Rc::clone do?

source: What does Rc::downgrade(&rc) return?
ru: Что означает Rc::downgrade(&amp;rc) return?

source: What does Rc::strong_count(&rc) show?
ru: Что показывает Rc::strong_count(&amp;rc)?

source: What does Rc::weak_count(&rc) show?
ru: Что показывает Rc::weak_count(&amp;rc)?

source: What does RefCell<T> do?
ru: Что означает RefCell<T> do?

source: What does RUST_BACKTRACE=1 show?
ru: Что показывает RUST_BACKTRACE=1?

source: What does self mean in a path?
ru: Что означает self in путь?

source: What does Self refer to in an impl?
ru: Что означает Self, относящийся к in и impl?

source: What does Self-Documentation mean?
ru: Что означает Self-Документация?

source: What does Sender::send(value) do in terms of ownership?
ru: Что означает отправитель::send(value) do in условия владения?

source: What does Single-Choice principle state?
ru: Что гласит принцип единственного выбора?

source: What does spawn_task return?
ru: Что означает spawn_task return?

source: What does struct destructuring do in a pattern?
ru: Что означает struct деструктуризация do in шаблона?

source: What does take do on a stream?
ru: Что занимает do в потоке?

source: What does the _ pattern do in match?
ru: Что означает шаблон _ do in match ?

source: What does the --show-output flag do when running cargo test?
ru: Что означает флаг --show-output do при запуске cargo test?

source: What does the ? operator do?
ru: Что означает оператор ? do?

source: What does the 'static lifetime mean?
ru: Что означает 'static срок службы?

source: What does the "struct update syntax" do?
ru: Что означает "struct обновить синтаксис" do?

source: What does the @ operator do in patterns?
ru: Что означает оператор @ do in ?

source: What does the #[should_panic] attribute do?
ru: Что означает атрибут #[should_panic] do?

source: What does the #[test] attribute before a function do?
ru: Что означает атрибут #[test] перед функцией do?

source: What does the | operator do in patterns?
ru: Что означает оператор | do in ?

source: What does the arrow => mean in match?
ru: Что означает стрелка =&gt; in match ?

source: What does the assert! macro do?
ru: Что значит "утверждать"! macro do?

source: What does the await keyword do?
ru: Что означает ключевое слово await do ?

source: What does the borrow checker do?
ru: Что проверяет заемщик do?

source: What does the builder's build() method typically do?
ru: Что обычно делает метод build() конструктора do?

source: What does the can_hold() method do?
ru: Что означает метод can_hold() do?

source: What does the chain() method do?
ru: Что означает метод chain() do?

source: What does the Deref trait do?
ru: Что такое Deref trait do ?

source: What does the Deserializer trait handle?
ru: Чем занимается десериализатор trait?

source: What does the entry method do?
ru: Что означает метод входа do?

source: What does the enumerate() method do?
ru: Что означает метод enumerate() do?

source: What does the find method return?
ru: Что означает метод find return?

source: What does the Fold pattern do?
ru: Что означает узор складка do?

source: What does the for_each method do for an iterator?
ru: Что делает метод for_each do for итератором?

source: What does the Interface Segregation Principle (ISP) recommend?
ru: Что рекомендует принцип разделения интерфейсов (ISP)?

source: What does the Interpreter pattern example convert?
ru: Что преобразует пример шаблона Interpreter?

source: What does the keyword super do?
ru: Что означает ключевое слово super do ?

source: What does the KISS principle stand for?
ru: Что означает принцип KISS for?

source: What does the marker trait Send mean?
ru: Что означает маркер trait Отправить?

source: What does the marker trait Sync mean?
ru: Что означает маркер trait Sync?

source: What does the match construct do?
ru: Что представляет собой конструкция match do ?

source: What does the mod keyword do?
ru: Что означает ключевое слово mod do ?

source: What does the move keyword do for a closure?
ru: Что означает ключевое слово move do for закрытие?

source: What does the next() method return?
ru: Что означает метод next() return?

source: What does the Open/Closed Principle (OCP) mean?
ru: Что означает принцип открытости/закрытости (OCP)?

source: What does the quote crate do?
ru: Что означает цитата crate do ?

source: What does the shorthand call look like?
ru: Как выглядит сокращение call?

source: What does the Single Responsibility Principle (SRP) state?
ru: Что гласит Принцип единой ответственности (SRP)?

source: What does the skip() method do?
ru: Что означает метод skip() do?

source: What does the slice &s[3..7] of a String store?
ru: Что хранит фрагмент &amp;s[3..7] сайта String?

source: What does the syn crate do?
ru: Что означает син crate do ?

source: What does the take() method do on Option?
ru: Что делает метод take() do на Option?

source: What does the take() method do?
ru: Что означает метод take() do?

source: What does the trpl::join! macro do?
ru: К чему присоединяется trpl::! macro do?

source: What does the unwrap_or_else method do for Option?
ru: Что означает метод unwrap_or_else do for Option?

source: What does the Visitor do if unexpected items are found?
ru: Что делает посетитель do if , когда обнаруживаются неожиданные предметы?

source: What does the Visitor in Serde do?
ru: Что означает посетитель in Serde do?

source: What does the Visitor pattern separate?
ru: Что разделяет шаблон "Посетитель"?

source: What does this code do? if let Some(x) = y { println!("{x}"); }
ru: Что означает этот код do? if let Some(x) = y { println!("{x}"); }

source: What does thread::sleep(Duration) do?
ru: Что означает поток::sleep(Duration) do?

source: What does thread::spawn do?
ru: Что означает нить::икра do?

source: What does throttle do on a stream?
ru: Что означает дроссель do в потоке?

source: What does trpl::join do?
ru: Что значит trpl::присоединиться к do?

source: What does trpl::join_all do?
ru: Что означает trpl::join_all do?

source: What does trpl::race do?
ru: Что такое trpl::race do?

source: What does trpl::run do?
ru: Что означает trpl::run do?

source: What does trpl::spawn_task do?
ru: Что означает trpl::spawn_task do?

source: What does unwrap_or_else(|e| { ... }) do?
ru: Что означает unwrap_or_else(|e| { ... }) do?

source: What does unwrap() on a Result do?
ru: Что означает функция unwrap() на Result do?

source: What does use std::collections::HashMap do?
ru: Что означает use std ::collections::HashMap do?

source: What does use std::io::{self, Write}; do?
ru: Что означает use std ::io::{self, Write}; do?

source: What does using generics as type classes allow?
ru: Что позволяет использование дженериков as type классов?

source: What does v.get(100) do if the index is out of bounds?
ru: Что означает v.get(100) do if , что индекс вышел за границы?

source: What does v[2] return if v = vec![1, 2, 3]?
ru: Что означает v[2] return if v = vec![1, 2, 3]?

source: What does Weak<T> store?
ru: Что хранится на сайте Weak<T>?

source: What does while let do?
ru: Что означает while let do ?

source: What does writing tests with Result<(), E> allow?
ru: Что позволяет писать тесты с Result<(), E> позволяет?

source: What does zip() do?
ru: Что означает zip() do?

source: What doesn't RefCell<T> do?
ru: А что не RefCell<T> do?

source: What doesn't the standard library provide for strings?
ru: Чего нет в стандартной библиотеке for для работы со строками?

source: What ecosystem uses this pattern for device register configuration?
ru: В какой экосистеме используется этот шаблон for для настройки регистров устройств?

source: What function is used in the declarative example?
ru: Какая функция используется in в декларативном примере?

source: What functions return never type?
ru: Какие функции return никогда не type?

source: What happens if a destructor panics during unwinding?
ru: Что произойдет if, если деструктор запаникует во время разворачивания?

source: What happens if a method and a field share a name?
ru: Что произойдет if, если метод и поле будут иметь одно и то же имя?

source: What happens if a struct lifetime parameter is not specified?
ru: Что произойдет if, если параметр времени жизни struct не будет указан?

source: What happens if join() is called before main thread does its work?
ru: Что произойдет, если if join() будет вызвана до того, как поток main выполнит свою работу?

source: What happens if last Rc<T> is destroyed but Weak<T> remain?
ru: Что произойдет, если последний if Rc<T> уничтожен, а слабый<T> остался?

source: What happens if lib.rs has mod garden; but there's no garden.rs or garden/mod.rs?
ru: Что произойдет, если if lib.rs будет содержать mod garden; но не будет ни garden.rs, ни garden/mod.rs?

source: What happens if thread with captured MutexGuard panics?
ru: Что происходит if поток с захваченным MutexGuard паникует?

source: What happens if you call a closure first with a string, then with a number?
ru: Что произойдет if, если вы вызовете закрытие сначала со строкой, а затем с числом?

source: What happens if you call mount_point() on FileDownloadRequest<Bootp>?
ru: Что произойдет if при вызове функции mount_point() на FileDownloadRequest<Bootp>?

source: What happens if you call next() on an exhausted iterator?
ru: Что происходит if при вызове функции next() на исчерпанном итераторе?

source: What happens if you call panic! in a test?
ru: Что происходит if вы называете паникой! in a test?

source: What happens if you call two borrow_mut() in a row in mock object?
ru: Что произойдет if при вызове двух borrow_mut() in в ряду in mock-объекта?

source: What happens if you don't cover all enum variants in a match?
ru: Что произойдет if, если вы не охватите все enum варианты in a match?

source: What happens if you panic in Drop::drop?
ru: Что произойдет if, если вы запаникуете in Падение::?

source: What happens if you pass cargo test add?
ru: Что произойдет if, если вы передадите груз test?

source: What happens if you put &str in a struct without a lifetime?
ru: Что произойдет if, если вы поставите иstr in struct без срока службы?

source: What happens if you return a reference to a local variable?
ru: Что произойдет if, если вы return ссылку на локальную переменную?

source: What happens if you store an iterator while mutating the collection in FFI?
ru: Что произойдет if, если вы сохраните итератор while, мутировав коллекцию in FFI?

source: What happens if you try to use a value after send(val)?
ru: Что произойдет if, если после send(val) вы попытаетесь отправить значение на use?

source: What happens if you use ? in a function returning ()?
ru: Что происходит if use ? in функции, возвращающей ()?

source: What happens if you use the > operator in a generic function without constraints?
ru: Что произойдет if, если вы use оператор &gt; in общую функцию без ограничений?

source: What happens on a name conflict?
ru: Что происходит при конфликте имен?

source: What happens to an iterator after calling sum()?
ru: Что происходит с итератором после вызова sum()?

source: What happens to child threads if main thread exits?
ru: Что происходит с дочерними потоками if main ?

source: What happens to user1.active if it's a bool?
ru: Что произойдет с user1.active if - это bool?

source: What happens to user1.username when using ..user1?
ru: Что происходит с именем пользователя user1.username при использовании ..user1?

source: What happens to vector elements when it goes out of scope?
ru: Что происходит с элементами вектора, когда он выходит за пределы области видимости?

source: What happens when an async block is compiled?
ru: Что происходит, когда компилируется блок async?

source: What happens when Box<T> goes out of scope?
ru: Что происходит, когда Box<T> выходит за рамки?

source: What happens when printing cyclic Rc structure without protection?
ru: Что произойдет, если распечатать циклическую Rc структуры без защиты?

source: What happens when sending on a channel if receiver is already closed?
ru: Что происходит при отправке по каналу if, приемник которого уже закрыт?

source: What happens when the owner goes out of scope?
ru: Что произойдет, если владелец выйдет за рамки?

source: What happens with &v[100] if there are fewer elements?
ru: Что произойдет с &amp;v[100] if с меньшим количеством элементов?

source: What happens with let s3 = s1 + &s2;?
ru: Что произойдет с let s3 = s1 + &amp;s2;?

source: What happens with println!("{rect1}")?
ru: Что произойдет с println!("{rect1}")?

source: What happens with pub struct S { x: i32 }?
ru: Что происходит с pub struct S { x: i32 }?

source: What happens with RefMut<T> if you try to take borrow() in parallel?
ru: Что произойдет с RefMut<T> if , если вы попытаетесь взять borrow() in параллельно?

source: What happens with simultaneous & and &mut to the same object?
ru: Что происходит с одновременным &amp; и &amp;mut одного и того же объекта?

source: What happens with two borrow_mut() in the same scope?
ru: Что произойдет с двумя borrow_mut() in в одной области видимости?

source: What happens with use std::fmt::Result and use std::io::Result?
ru: Что происходит с use std ::fmt::Result и use std ::io::Result?

source: What happens with v[99] if v is shorter?
ru: Что происходит с v[99] if v короче?

source: What happens? let x = (let y = 6);
ru: Что происходит? let x = (let y = 6);

source: What helper functions are common in Visitor implementations?
ru: Какие вспомогательные функции являются общими для реализаций in Visitor?

source: What if both garden.rs and garden/mod.rs exist?
ru: Что if и garden.rs, и garden/mod.rs существуют?

source: What if Ref<T> hasn't left scope and we take borrow_mut()?
ru: Что if Ref<T> не покинул область видимости, и мы берем borrow_mut()?

source: What if you create both file.rs and dir/mod.rs for the same module?
ru: Что if вы создаете и file.rs, и dir/mod.rs for одного и того же модуля?

source: What if you need different types in a Vec?
ru: Что if вам нужно для разных типов in a Vec?

source: What inheritance model does Deref polymorphism support?
ru: Какую модель наследования поддерживает полиморфизм Deref?

source: What is _ used for in match?
ru: Что _ используется for in match ?

source: What is "interior mutability"?
ru: Что такое "внутренняя изменчивость"?

source: What is #[derive(Debug)] useful for in list/tree examples?
ru: Что такое #[derive(Debug)] полезный for in список/дерево примеров?

source: What is a "bad state"?
ru: Что такое "плохое состояние"?

source: What is a "dangling" reference?
ru: Что такое "висячая" ссылка?

source: What is a "recursive type with known size"?
ru: Что такое "рекурсивный type с известным размером"?

source: What is a "smart pointer" in Rust?
ru: Что такое "умный указатель" in Rust?

source: What is a "thread" in the context of Rust (standard library)?
ru: Что такое "поток" in в контексте Rust (стандартная библиотека)?

source: What is a better alternative to #![deny(warnings)]?
ru: Что является лучшей альтернативой #![deny(warnings)]?

source: What is a better alternative to Deref polymorphism?
ru: Что является лучшей альтернативой полиморфизму Deref?

source: What is a blanket implementation?
ru: Что такое комплексное внедрение?

source: What is a crate in Rust?
ru: Что такое crate in Rust?

source: What is a custom derive macro?
ru: Что такое пользовательское выведение macro?

source: What is a declarative macro?
ru: Что такое декларативный macro?

source: What is a default type parameter?
ru: Что такое параметр по умолчанию type?

source: What is a disadvantage of Deref polymorphism?
ru: Что является недостатком полиморфизма Deref?

source: What is a disadvantage of generics as type classes?
ru: В чем недостаток дженериков as type классов?

source: What is a disadvantage of many small crates?
ru: В чем недостаток множества маленьких ящиков?

source: What is a disadvantage of newtypes?
ru: Что является недостатком новых типов?

source: What is a function pointer (fn)?
ru: Что такое указатель функции (fn)?

source: What is a Future in Rust?
ru: Что такое будущее in Rust?

source: What is a getter in Rust?
ru: Что такое геттер in Rust?

source: What is a lifetime?
ru: Что такое целая жизнь?

source: What is a match guard?
ru: Что такое охранник match?

source: What is a package?
ru: Что такое пакет?

source: What is a Prism optic?
ru: Что такое призменная оптика?

source: What is a re-export?
ru: Что такое реэкспорт?

source: What is a refutable pattern?
ru: Что такое опровержимый образец?

source: What is a safe abstraction?
ru: Что такое безопасная абстракция?

source: What is a slice (&str, &[T])?
ru: Что такое срез (&amp;str, &amp;[T])?

source: What is a state machine in the async context?
ru: Что такое машина состояний in контекста async?

source: What is a Stream in async Rust?
ru: Что такое поток in async Rust?

source: What is a supertrait?
ru: Что такое суперпортрет?

source: What is a task in async Rust?
ru: Что такое задание in async Rust?

source: What is a trait in Rust?
ru: Что такое trait in Rust?

source: What is a trait object in async contexts?
ru: Что такое объект trait in async контекстов?

source: What is a trait object?
ru: Что такое объект trait?

source: What is a tuple struct?
ru: Что такое кортеж struct?

source: What is a type alias?
ru: Что такое псевдоним type?

source: What is a unit-like struct?
ru: Что такое единичное struct?

source: What is an "await point"?
ru: Что такое "точкаawait "?

source: What is an advantage of taking builder methods by mutable reference?
ru: В чем преимущество приема методов конструктора по мутабельной ссылке?

source: What is an advantage of using generics as type classes?
ru: В чем преимущество использования дженериков as type классов?

source: What is an alternative to #[non_exhaustive] for preventing direct struct instantiation within a crate?
ru: Что является альтернативой #[не_исчерпывающему] for, предотвращающему прямое struct инстанцирование внутри crate?

source: What is an alternative to trait objects for implementing the Command pattern?
ru: Что является альтернативой объектам trait for , реализующим паттерн Command?

source: What is an associated function?
ru: Что такое ассоциированная функция?

source: What is an associated type in trait?
ru: Что такое ассоциированный type in trait ?

source: What is an async channel?
ru: Что такое канал async?

source: What is an async runtime?
ru: Что такое время выполнения async?

source: What is an attribute-like macro?
ru: Что такое атрибутоподобный macro?

source: What is an irrefutable pattern?
ru: Что такое неопровержимая закономерность?

source: What is an unsafe trait?
ru: Что такое unsafe trait ?

source: What is Box<dyn Trait> useful for?
ru: Что такое Box&lt;dyn Черта&gt; полезная for?

source: What is copied in let s2 = s1; for String?
ru: Что скопировано in let s2 = s1; for String ?

source: What is currying mentioned in the functional programming context?
ru: Что такое "карри" in в контексте функционального программирования?

source: What is Deref polymorphism?
ru: Что такое полиморфизм Deref?

source: What is DerefMut for?
ru: Что такое DerefMut for?

source: What is DST (Dynamically Sized Type)?
ru: Что такое DST (Dynamically Sized Type)?

source: What is duck typing?
ru: Что такое "утиный набор"?

source: What is dynamic dispatch?
ru: Что такое динамическая диспетчеризация?

source: What is encapsulation?
ru: Что такое инкапсуляция?

source: What is Encapsulation?
ru: Что такое инкапсуляция?

source: What is error propagation?
ru: Что такое распространение ошибок?

source: What is fully qualified syntax?
ru: Что такое полностью квалифицированный синтаксис?

source: What is iterator "laziness"?
ru: Что такое "лень" итератора?

source: What is JoinHandle::join for?
ru: Что такое JoinHandle::join for?

source: What is lifetime elision?
ru: Что такое пожизненная элизия?

source: What is metaprogramming?
ru: Что такое метапрограммирование?

source: What is Miri?
ru: Что такое Мири?

source: What is monomorphization?
ru: Что такое мономорфизация?

source: What is Mutex<T>?
ru: Что такое Mutex<T>?

source: What is needed to use rand::thread_rng()?
ru: Что необходимо для use rand::thread_rng()?

source: What is Option?
ru: Что такое Option?

source: What is ownership in Rust?
ru: Что такое собственность in Rust?

source: What is Persistence-Closure principle?
ru: Что такое принцип "постоянство-закрытие"?

source: What is polymorphism?
ru: Что такое полиморфизм?

source: What is Rc<T> for?
ru: Что такое Rc<T> for?

source: What is Rust's equivalent to finally blocks?
ru: Что в Rust эквивалентно блокам finally?

source: What is shadowing?
ru: Что такое тень?

source: What is static dispatch?
ru: Что такое static диспетчерская служба?

source: What is StreamExt?
ru: Что такое StreamExt?

source: What is String?
ru: Что такое String?

source: What is the #[ignore] attribute used for in a test?
ru: Какой атрибут #[ignore] используется for in a test?

source: What is the advantage of the Visitor pattern?
ru: В чем преимущество шаблона "Посетитель"?

source: What is the advantage of using fresh data structures in the Fold pattern?
ru: В чем преимущество использования свежих структур данных in в шаблоне Fold?

source: What is the automatic conversion of references through Deref in function signatures called?
ru: Как называется автоматическое преобразование ссылок через сигнатуры функций Deref in?
